

上面生成的gccxml.exe就是我们用来解析源码文件的工具，当然这玩意不能单独使用，他只是一个补丁，他得依附在编译器上，所以你得保证你的电脑上安装了编译器。下面是GCCXML支持的几个编译器（有点奇怪的是我电脑上其实只有vs2010，但也成功了，虽然下面没有列出来
后来经过测试发现确实用的是08的，可能之前没有卸载干净，可以通过get_gccxml_compiler
(
)来获取当前的版本
）：

·            GCC
: Versions 4.2,4.1, 4.0, 3.4, 3.3, 3.2, 2.95.x

·            VisualC++
: Versions 8, 7.1, 7.0, and 6 (sp5)

·            Borland,Intel, SGI
: formerly supported but no longer tested

他的命令行&#26684;式是这样的：gccxml[options] <input-file> -fxml=<output-file>

具体的选项可以参考http://gccxml.github.io/HTML/Running.html
，这里我只用了最简单的&#26684;式。

这里用来测试的文件是取自SWMM引擎的hash.c代码如下：






//-----------------------------------------------------------------------------
//   hash.c
//
//   Implementation of a simple Hash Table for string storage & retrieval
//   CASE INSENSITIVE
//
//   Written by L. Rossman
//   Last Updated on 6/19/03
//
//   The hash table data structure (HTable) is defined in "hash.h".
//   Interface Functions:
//      HTcreate() - creates a hash table
//      HTinsert() - inserts a string & its index value into a hash table
//      HTfind()   - retrieves the index value of a string from a table
//      HTfree()   - frees a hash table
//-----------------------------------------------------------------------------

#include <malloc.h>
#include <string.h>
#include "hash.h"
#define UCHAR(x) (((x) >= 'a' && (x) <= 'z') ? ((x)&~32) : (x))

/* Case-insensitive comparison of strings s1 and s2 */
int  samestr(char *s1, char *s2)
{
   int i;

  </Function>
  <Function id="_238" name="wcsrchr" returns="_259" context="_1" mangled="_Z7wcsrchrPww" demangled="wcsrchr(wchar_t*, wchar_t)" location="f0:365" file="f0" line="365" endline="366" inline="1" attributes="__cdecl__">
    <Argument name="_Str" type="_259" location="f0:365" file="f0" line="365"/>
    <Argument name="_Ch" type="_260" location="f0:365" file="f0" line="365"/>
  </Function>
  <Function id="_239" name="wcsrchr" returns="_264" context="_1" location="f0:308" file="f0" line="308" extern="1" attributes="__cdecl__">
    <Argument name="_Str" type="_264" location="f0:308" file="f0" line="308"/>
    <Argument name="_Ch" type="_260" location="f0:308" file="f0" line="308"/>
  </Function>
  <Struct id="_240" name="PostRangeAttribute" context="_93" mangled="N13vc_attributes18PostRangeAttributeE" demangled="vc_attributes::PostRangeAttribute" location="f4:199" file="f4" line="199" artificial="1" size="96" align="32" members="_404 _405 _406 _407 _408 _409 _410 " bases=""/>
  <Typedef id="_241" name="SA_PostRange" type="_240" context="_1" location="f4:255" file="f4" line="255"/>
  <Function id="_242" name="strncpy_s" returns="_115" context="_1" location="f0:185" file="f0" line="185" extern="1" attributes="__cdecl__">
    <Argument name="_Dst" type="_65" location="f0:185" file="f0" line="185"/>
    <Argument name="_SizeInBytes" type="_30" location="f0:185" file="f0" line="185"/>
    <Argument name="_Src" type="_261" location="f0:185" file="f0" line="185"/>
    <Argument name="_MaxCount" type="_30" location="f0:185" file="f0" line="185"/>
  </Function>
  <Function id="_243" name="_strupr" returns="_65" context="_1" location="f0:203" file="f0" line="203" extern="1" attributes="__cdecl__">
    <Argument name="_String" type="_65" location="f0:203" file="f0" line="203"/>
  </Function>
  <Function id="_244" name="_msize" returns="_161" context="_1" location="f1:158" file="f1" line="158" extern="1" attributes="__cdecl__">
    <Argument name="_Memory" type="_262" location="f1:158" file="f1" line="158"/>
  </Function>
  <Function id="_245" name="_strnset_s" returns="_115" context="_1" location="f0:189" file="f0" line="189" extern="1" attributes="__cdecl__">
    <Argument name="_Str" type="_65" location="f0:189" file="f0" line="189"/>
    <Argument name="_SizeInBytes" type="_161" location="f0:189" file="f0" line="189"/>
    <Argument name="_Val" type="_114" location="f0:189" file="f0" line="189"/>
    <Argument name="_MaxCount" type="_161" location="f0:189" file="f0" line="189"/>
  </Function>
  <Struct id="_246" name="threadmbcinfostruct" context="_1" incomplete="1" mangled="19threadmbcinfostruct" demangled="threadmbcinfostruct" location="f3:1954" file="f3" line="1954" artificial="1" align="8"/>
  <Function id="_247" name="_wcsdup" returns="_259" context="_1" location="f0:266" file="f0" line="266" extern="1" attributes="__cdecl__">
    <Argument name="_Str" type="_264" location="f0:266" file="f0" line="266"/>
  </Function>
  <ArrayType id="_248" min="0" max="0u" type="_325" size="8" align="8"/>
  <Typedef id="_249" name="__static_assert_t" type="_248" context="_1" location="f1:187" file="f1" line="187"/>
  <Function id="_250" name="_strdup" returns="_65" context="_1" location="f0:135" file="f0" line="135" extern="1" attributes="__cdecl__">
    <Argument name="_Src" type="_261" location="f0:135" file="f0" line="135"/>
  </Function>
  <Function id="_251" name="_wcsicmp_l" returns="_114" context="_1" location="f0:323" file="f0" line="323" extern="1" attributes="__cdecl__">
    <Argument name="_Str1" type="_264" location="f0:323" file="f0" line="323"/>
    <Argument name="_Str2" type="_264" location="f0:323" file="f0" line="323"/>
    <Argument name="_Locale" type="_54" location="f0:323" file="f0" line="323"/>
  </Function>
  <Function id="_252" name="wcslwr" returns="_259" context="_1" location="f0:395" file="f0" line="395" extern="1" attributes="__cdecl__">
    <Argument name="_Str" type="_259" location="f0:395" file="f0" line="395"/>
  </Function>
  <Variable id="_253" name="SA_No" type="_270c" init="No" context="_1" location="f4:237" file="f4" line="237" static="1"/>
  <Function id="_254" name="wcscspn" returns="_161" context="_1" location="f0:284" file="f0" line="284" extern="1" attributes="__cdecl__">
    <Argument name="_Str" type="_264" location="f0:284" file="f0" line="284"/>
    <Argument name="_Control" type="_264" location="f0:284" file="f0" line="284"/>
  </Function>
  <Function id="_255" name="strlwr" returns="_65" context="_1" location="f0:247" file="f0" line="247" extern="1" attributes="__cdecl__">
    <Argument name="_Str" type="_65" location="f0:247" file="f0" line="247"/>
  </Function>
  <Function id="_256" name="strcpy_s" returns="_115" context="_1" location="f0:102" file="f0" line="102" extern="1" attributes="__cdecl__">
    <Argument name="_Dst" type="_65" location="f0:102" file="f0" line="102"/>
    <Argument name="_SizeInBytes" type="_30" location="f0:102" file="f0" line="102"/>
    <Argument name="_Src" type="_261" location="f0:102" file="f0" line="102"/>
  </Function>
  <Struct id="_257" name="HTentry" context="_1" mangled="7HTentry" demangled="HTentry" location="f6:11" file="f6" line="11" artificial="1" size="96" align="32" members="_411 _412 _413 _414 _415 _416 _417 " bases=""/>
  <Function id="_258" name="samestr" returns="_114" context="_1" mangled="_Z7samestrPcS_" demangled="samestr(char*, char*)" location="f2:24" file="f2" line="24" endline="29">
    <Argument name="s1" type="_65" location="f2:24" file="f2" line="24"/>
    <Argument name="s2" type="_65" location="f2:24" file="f2" line="24"/>
  </Function>
  <PointerType id="_259" type="_260" size="32" align="32"/>
  <FundamentalType id="_260" name="wchar_t" size="16" align="16"/>
  <PointerType id="_261" type="_325c" size="32" align="32"/>
  <PointerType id="_262" type="_271" size="32" align="32"/>
  <PointerType id="_263" type="_210" size="32" align="32"/>
  <PointerType id="_264" type="_260c" size="32" align="32"/>
  <Field id="_265" name="Deref" type="_29" offset="0" context="_15" access="public" location="f4:183" file="f4" line="183"/>
  <Destructor id="_266" name="PostBoundAttribute" artificial="1" throw="" context="_15" access="public" mangled="_ZN13vc_attributes18PostBoundAttributeD1Ev *INTERNAL* " demangled="vc_attributes::PostBoundAttribute::~PostBoundAttribute()" location="f4:179" file="f4" line="179" endline="179" inline="1">
  </Destructor>
  <OperatorMethod id="_267" name="=" returns="_420" artificial="1" throw="" context="_15" access="public" mangled="_ZN13vc_attributes18PostBoundAttributeaSERKS0_" demangled="vc_attributes::PostBoundAttribute::operator=(vc_attributes::PostBoundAttribute const&)" location="f4:179" file="f4" line="179" endline="179" inline="1">
    <Argument type="_421" location="f4:179" file="f4" line="179"/>
  </OperatorMethod>
  <Constructor id="_268" name="PostBoundAttribute" artificial="1" throw="" context="_15" access="public" mangled="_ZN13vc_attributes18PostBoundAttributeC1ERKS0_ *INTERNAL* " demangled="vc_attributes::PostBoundAttribute::PostBoundAttribute(vc_attributes::PostBoundAttribute const&)" location="f4:179" file="f4" line="179" endline="179" inline="1">
    <Argument type="_421" location="f4:179" file="f4" line="179"/>
  </Constructor>
  <Constructor id="_269" name="PostBoundAttribute" explicit="1" context="_15" access="public" mangled="_ZN13vc_attributes18PostBoundAttributeC1Ev *INTERNAL* " demangled="vc_attributes::PostBoundAttribute::PostBoundAttribute()" location="f4:181" file="f4" line="181" extern="1"/>
  <Typedef id="_270" name="YesNoMaybe" type="_22" context="_93" location="f4:64" file="f4" line="64"/>
  <FundamentalType id="_271" name="void" align="8"/>
  <Typedef id="_272" name="AccessType" type="_204" context="_93" location="f4:74" file="f4" line="74"/>
  <CvQualifiedType id="_272c" type="_272" const="1"/>
  <Field id="_274" name="Deref" type="_29" offset="0" context="_35" access="public" location="f4:85" file="f4" line="85"/>
  <Field id="_275" name="Valid" type="_270" offset="32" context="_35" access="public" location="f4:86" file="f4" line="86"/>
  <Field id="_276" name="Null" type="_270" offset="64" context="_35" access="public" location="f4:87" file="f4" line="87"/>
  <Field id="_277" name="Tainted" type="_270" offset="96" context="_35" access="public" location="f4:88" file="f4" line="88"/>
  <Field id="_278" name="Access" type="_272" offset="128" context="_35" access="public" location="f4:89" file="f4" line="89"/>
  <Field id="_279" name="ValidElementsConst" type="_161" offset="160" context="_35" access="public" location="f4:90" file="f4" line="90"/>
  <Field id="_280" name="ValidBytesConst" type="_161" offset="192" context="_35" access="public" location="f4:91" file="f4" line="91"/>
  <Field id="_281" name="ValidElements" type="_264" offset="224" context="_35" access="public" location="f4:92" file="f4" line="92"/>
  <Field id="_282" name="ValidBytes" type="_264" offset="256" context="_35" access="public" location="f4:93" file="f4" line="93"/>
  <Field id="_283" name="ValidElementsLength" type="_264" offset="288" context="_35" access="public" location="f4:94" file="f4" line="94"/>
  <Field id="_284" name="ValidBytesLength" type="_264" offset="320" context="_35" access="public" location="f4:95" file="f4" line="95"/>
  <Field id="_285" name="WritableElementsConst" type="_161" offset="352" context="_35" access="public" location="f4:96" file="f4" line="96"/>
  <Field id="_286" name="WritableBytesConst" type="_161" offset="384" context="_35" access="public" location="f4:97" file="f4" line="97"/>
  <Field id="_287" name="WritableElements" type="_264" offset="416" context="_35" access="public" location="f4:98" file="f4" line="98"/>
  <Field id="_288" name="WritableBytes" type="_264" offset="448" context="_35" access="public" location="f4:99" file="f4" line="99"/>
  <Field id="_289" name="WritableElementsLength" type="_264" offset="480" context="_35" access="public" location="f4:100" file="f4" line="100"/>
  <Field id="_290" name="WritableBytesLength" type="_264" offset="512" context="_35" access="public" location="f4:101" file="f4" line="101"/>
  <Field id="_291" name="ElementSizeConst" type="_161" offset="544" context="_35" access="public" location="f4:102" file="f4" line="102"/>
  <Field id="_292" name="ElementSize" type="_264" offset="576" context="_35" access="public" location="f4:103" file="f4" line="103"/>
  <Field id="_293" name="NullTerminated" type="_270" offset="608" context="_35" access="public" location="f4:104" file="f4" line="104"/>
  <Field id="_294" name="Condition" type="_264" offset="640" context="_35" access="public" location="f4:105" file="f4" line="105"/>
  <Destructor id="_295" name="PreAttribute" artificial="1" throw="" context="_35" access="public" mangled="_ZN13vc_attributes12PreAttributeD1Ev *INTERNAL* " demangled="vc_attributes::PreAttribute::~PreAttribute()" location="f4:80" file="f4" line="80" endline="80" inline="1">
  </Destructor>
  <OperatorMethod id="_296" name="=" returns="_422" artificial="1" throw="" context="_35" access="public" mangled="_ZN13vc_attributes12PreAttributeaSERKS0_" demangled="vc_attributes::PreAttribute::operator=(vc_attributes::PreAttribute const&)" location="f4:80" file="f4" line="80" endline="80" inline="1">
    <Argument type="_423" location="f4:80" file="f4" line="80"/>
  </OperatorMethod>
  <Constructor id="_297" name="PreAttribute" artificial="1" throw="" context="_35" access="public" mangled="_ZN13vc_attributes12PreAttributeC1ERKS0_ *INTERNAL* " demangled="vc_attributes::PreAttribute::PreAttribute(vc_attributes::PreAttribute const&)" location="f4:80" file="f4" line="80" endline="80" inline="1">
    <Argument type="_423" location="f4:80" file="f4" line="80"/>
  </Constructor>
  <Constructor id="_298" name="PreAttribute" explicit="1" context="_35" access="public" mangled="_ZN13vc_attributes12PreAttributeC1Ev *INTERNAL* " demangled="vc_attributes::PreAttribute::PreAttribute()" location="f4:82" file="f4" line="82" extern="1"/>
  <Field id="_299" name="Condition" type="_264" offset="0" context="_40" access="public" location="f4:165" file="f4" line="165"/>
  <Destructor id="_300" name="SuccessAttribute" artificial="1" throw="" context="_40" access="public" mangled="_ZN13vc_attributes16SuccessAttributeD1Ev *INTERNAL* " demangled="vc_attributes::SuccessAttribute::~SuccessAttribute()" location="f4:160" file="f4" line="160" endline="160" inline="1">
  </Destructor>
  <OperatorMethod id="_301" name="=" returns="_424" artificial="1" throw="" context="_40" access="public" mangled="_ZN13vc_attributes16SuccessAttributeaSERKS0_" demangled="vc_attributes::SuccessAttribute::operator=(vc_attributes::SuccessAttribute const&)" location="f4:160" file="f4" line="160" endline="160" inline="1">
    <Argument type="_425" location="f4:160" file="f4" line="160"/>
  </OperatorMethod>
  <Constructor id="_302" name="SuccessAttribute" artificial="1" throw="" context="_40" access="public" mangled="_ZN13vc_attributes16SuccessAttributeC1ERKS0_ *INTERNAL* " demangled="vc_attributes::SuccessAttribute::SuccessAttribute(vc_attributes::SuccessAttribute const&)" location="f4:160" file="f4" line="160" endline="160" inline="1">
    <Argument type="_425" location="f4:160" file="f4" line="160"/>
  </Constructor>
  <Constructor id="_303" name="SuccessAttribute" explicit="1" context="_40" access="public" mangled="_ZN13vc_attributes16SuccessAttributeC1Ev *INTERNAL* " demangled="vc_attributes::SuccessAttribute::SuccessAttribute()" location="f4:162" file="f4" line="162" extern="1"/>
  <Field id="_304" name="_pentry" type="_426" offset="0" context="_44" access="public" location="f1:59" file="f1" line="59"/>
  <Field id="_305" name="_size" type="_161" offset="32" context="_44" access="public" location="f1:60" file="f1" line="60"/>
  <Field id="_306" name="_useflag" type="_114" offset="64" context="_44" access="public" location="f1:61" file="f1" line="61"/>
  <Destructor id="_307" name="_heapinfo" artificial="1" throw="" context="_44" access="public" mangled="_ZN9_heapinfoD1Ev *INTERNAL* " demangled="_heapinfo::~_heapinfo()" location="f1:58" file="f1" line="58" endline="58" inline="1">
  </Destructor>
  <OperatorMethod id="_308" name="=" returns="_427" artificial="1" throw="" context="_44" access="public" mangled="_ZN9_heapinfoaSERKS_" demangled="_heapinfo::operator=(_heapinfo const&)" location="f1:58" file="f1" line="58" endline="58" inline="1">
    <Argument type="_428" location="f1:58" file="f1" line="58"/>
  </OperatorMethod>
  <Constructor id="_309" name="_heapinfo" artificial="1" throw="" context="_44" access="public" mangled="_ZN9_heapinfoC1ERKS_ *INTERNAL* " demangled="_heapinfo::_heapinfo(_heapinfo const&)" location="f1:58" file="f1" line="58" endline="58" inline="1">
    <Argument type="_428" location="f1:58" file="f1" line="58"/>
  </Constructor>
  <Constructor id="_310" name="_heapinfo" artificial="1" throw="" context="_44" access="public" mangled="_ZN9_heapinfoC1Ev *INTERNAL* " demangled="_heapinfo::_heapinfo()" location="f1:58" file="f1" line="58" inline="1"/>
  <Field id="_311" name="wLanguage" type="_11" offset="0" context="_45" access="public" location="f3:1967" file="f3" line="1967"/>
  <Field id="_312" name="wCountry" type="_11" offset="16" context="_45" access="public" location="f3:1968" file="f3" line="1968"/>
  <Field id="_313" name="wCodePage" type="_11" offset="32" context="_45" access="public" location="f3:1969" file="f3" line="1969"/>
  <Destructor id="_314" name="tagLC_ID" artificial="1" throw="" context="_45" access="public" mangled="_ZN8tagLC_IDD1Ev *INTERNAL* " demangled="tagLC_ID::~tagLC_ID()" location="f3:1966" file="f3" line="1966" endline="1966" inline="1">
  </Destructor>
  <OperatorMethod id="_315" name="=" returns="_429" artificial="1" throw="" context="_45" access="public" mangled="_ZN8tagLC_IDaSERKS_" demangled="tagLC_ID::operator=(tagLC_ID const&)" location="f3:1966" file="f3" line="1966" endline="1966" inline="1">
    <Argument type="_430" location="f3:1966" file="f3" line="1966"/>
  </OperatorMethod>
  <Constructor id="_316" name="tagLC_ID" artificial="1" throw="" context="_45" access="public" mangled="_ZN8tagLC_IDC1ERKS_ *INTERNAL* " demangled="tagLC_ID::tagLC_ID(tagLC_ID const&)" location="f3:1966" file="f3" line="1966" endline="1966" inline="1">
    <Argument type="_430" location="f3:1966" file="f3" line="1966"/>
  </Constructor>
  <Constructor id="_317" name="tagLC_ID" artificial="1" throw="" context="_45" access="public" mangled="_ZN8tagLC_IDC1Ev *INTERNAL* " demangled="tagLC_ID::tagLC_ID()" location="f3:1966" file="f3" line="1966" inline="1"/>
  <PointerType id="_318" type="_271c" size="32" align="32"/>
  <Field id="_319" name="locinfo" type="_173" offset="0" context="_63" access="public" location="f3:1961" file="f3" line="1961"/>
  <Field id="_320" name="mbcinfo" type="_229" offset="32" context="_63" access="public" location="f3:1962" file="f3" line="1962"/>
  <Destructor id="_321" name="localeinfo_struct" artificial="1" throw="" context="_63" access="public" mangled="_ZN17localeinfo_structD1Ev *INTERNAL* " demangled="localeinfo_struct::~localeinfo_struct()" location="f3:1960" file="f3" line="1960" endline="1960" inline="1">
  </Destructor>
  <OperatorMethod id="_322" name="=" returns="_432" artificial="1" throw="" context="_63" access="public" mangled="_ZN17localeinfo_structaSERKS_" demangled="localeinfo_struct::operator=(localeinfo_struct const&)" location="f3:1960" file="f3" line="1960" endline="1960" inline="1">
    <Argument type="_433" location="f3:1960" file="f3" line="1960"/>
  </OperatorMethod>
  <Constructor id="_323" name="localeinfo_struct" artificial="1" throw="" context="_63" access="public" mangled="_ZN17localeinfo_structC1ERKS_ *INTERNAL* " demangled="localeinfo_struct::localeinfo_struct(localeinfo_struct const&)" location="f3:1960" file="f3" line="1960" endline="1960" inline="1">
    <Argument type="_433" location="f3:1960" file="f3" line="1960"/>
  </Constructor>
  <Constructor id="_324" name="localeinfo_struct" artificial="1" throw="" context="_63" access="public" mangled="_ZN17localeinfo_structC1Ev *INTERNAL* " demangled="localeinfo_struct::localeinfo_struct()" location="f3:1960" file="f3" line="1960" inline="1"/>
  <CvQualifiedType id="_270c" type="_270" const="1"/>
  <Field id="_327" name="Value" type="_165" offset="0" context="_88" access="public" location="f4:156" file="f4" line="156"/>
  <Destructor id="_328" name="InvalidCheckAttribute" artificial="1" throw="" context="_88" access="public" mangled="_ZN13vc_attributes21InvalidCheckAttributeD1Ev *INTERNAL* " demangled="vc_attributes::InvalidCheckAttribute::~InvalidCheckAttribute()" location="f4:151" file="f4" line="151" endline="151" inline="1">
  </Destructor>
  <OperatorMethod id="_329" name="=" returns="_434" artificial="1" throw="" context="_88" access="public" mangled="_ZN13vc_attributes21InvalidCheckAttributeaSERKS0_" demangled="vc_attributes::InvalidCheckAttribute::operator=(vc_attributes::InvalidCheckAttribute const&)" location="f4:151" file="f4" line="151" endline="151" inline="1">
    <Argument type="_435" location="f4:151" file="f4" line="151"/>
  </OperatorMethod>
  <Constructor id="_330" name="InvalidCheckAttribute" artificial="1" throw="" context="_88" access="public" mangled="_ZN13vc_attributes21InvalidCheckAttributeC1ERKS0_ *INTERNAL* " demangled="vc_attributes::InvalidCheckAttribute::InvalidCheckAttribute(vc_attributes::InvalidCheckAttribute const&)" location="f4:151" file="f4" line="151" endline="151" inline="1">
    <Argument type="_435" location="f4:151" file="f4" line="151"/>
  </Constructor>
  <Constructor id="_331" name="InvalidCheckAttribute" explicit="1" context="_88" access="public" mangled="_ZN13vc_attributes21InvalidCheckAttributeC1Ev *INTERNAL* " demangled="vc_attributes::InvalidCheckAttribute::InvalidCheckAttribute()" location="f4:153" file="f4" line="153" extern="1"/>
  <Field id="_332" name="Style" type="_264" offset="0" context="_108" access="public" location="f4:145" file="f4" line="145"/>
  <Field id="_333" name="UnformattedAlternative" type="_264" offset="32" context="_108" access="public" location="f4:146" file="f4" line="146"/>
  <Destructor id="_334" name="FormatStringAttribute" artificial="1" throw="" context="_108" access="public" mangled="_ZN13vc_attributes21FormatStringAttributeD1Ev *INTERNAL* " demangled="vc_attributes::FormatStringAttribute::~FormatStringAttribute()" location="f4:140" file="f4" line="140" endline="140" inline="1">
  </Destructor>
  <OperatorMethod id="_335" name="=" returns="_436" artificial="1" throw="" context="_108" access="public" mangled="_ZN13vc_attributes21FormatStringAttributeaSERKS0_" demangled="vc_attributes::FormatStringAttribute::operator=(vc_attributes::FormatStringAttribute const&)" location="f4:140" file="f4" line="140" endline="140" inline="1">
    <Argument type="_437" location="f4:140" file="f4" line="140"/>
  </OperatorMethod>
  <Constructor id="_336" name="FormatStringAttribute" artificial="1" throw="" context="_108" access="public" mangled="_ZN13vc_attributes21FormatStringAttributeC1ERKS0_ *INTERNAL* " demangled="vc_attributes::FormatStringAttribute::FormatStringAttribute(vc_attributes::FormatStringAttribute const&)" location="f4:140" file="f4" line="140" endline="140" inline="1">
    <Argument type="_437" location="f4:140" file="f4" line="140"/>
  </Constructor>
  <Constructor id="_337" name="FormatStringAttribute" explicit="1" context="_108" access="public" mangled="_ZN13vc_attributes21FormatStringAttributeC1Ev *INTERNAL* " demangled="vc_attributes::FormatStringAttribute::FormatStringAttribute()" location="f4:142" file="f4" line="142" extern="1"/>
  <Field id="_338" name="Deref" type="_29" offset="0" context="_137" access="public" location="f4:174" file="f4" line="174"/>
  <Destructor id="_339" name="PreBoundAttribute" artificial="1" throw="" context="_137" access="public" mangled="_ZN13vc_attributes17PreBoundAttributeD1Ev *INTERNAL* " demangled="vc_attributes::PreBoundAttribute::~PreBoundAttribute()" location="f4:170" file="f4" line="170" endline="170" inline="1">
  </Destructor>
  <OperatorMethod id="_340" name="=" returns="_438" artificial="1" throw="" context="_137" access="public" mangled="_ZN13vc_attributes17PreBoundAttributeaSERKS0_" demangled="vc_attributes::PreBoundAttribute::operator=(vc_attributes::PreBoundAttribute const&)" location="f4:170" file="f4" line="170" endline="170" inline="1">
    <Argument type="_439" location="f4:170" file="f4" line="170"/>
  </OperatorMethod>
  <Constructor id="_341" name="PreBoundAttribute" artificial="1" throw="" context="_137" access="public" mangled="_ZN13vc_attributes17PreBoundAttributeC1ERKS0_ *INTERNAL* " demangled="vc_attributes::PreBoundAttribute::PreBoundAttribute(vc_attributes::PreBoundAttribute const&)" location="f4:170" file="f4" line="170" endline="170" inline="1">
    <Argument type="_439" location="f4:170" file="f4" line="170"/>
  </Constructor>
  <Constructor id="_342" name="PreBoundAttribute" explicit="1" context="_137" access="public" mangled="_ZN13vc_attributes17PreBoundAttributeC1Ev *INTERNAL* " demangled="vc_attributes::PreBoundAttribute::PreBoundAttribute()" location="f4:172" file="f4" line="172" extern="1"/>
  <PointerType id="_343" type="_65" size="32" align="32"/>
  <PointerType id="_344" type="_259" size="32" align="32"/>
  <PointerType id="_345" type="_75" size="32" align="32"/>
  <Field id="_346" name="refcount" type="_114" offset="0" context="_163" access="public" location="f3:1976" file="f3" line="1976"/>
  <Field id="_347" name="lc_codepage" type="_29" offset="32" context="_163" access="public" location="f3:1977" file="f3" line="1977"/>
  <Field id="_348" name="lc_collate_cp" type="_29" offset="64" context="_163" access="public" location="f3:1978" file="f3" line="1978"/>
  <Field id="_349" name="lc_handle" type="_440" offset="96" context="_163" access="public" location="f3:1979" file="f3" line="1979"/>
  <Field id="_350" name="lc_id" type="_441" offset="288" context="_163" access="public" location="f3:1980" file="f3" line="1980"/>
  <Field id="_351" name="lc_category" type="_442" offset="576" context="_163" access="public" location="f3:1986" file="f3" line="1986"/>
  <Field id="_352" name="lc_clike" type="_114" offset="1344" context="_163" access="public" location="f3:1987" file="f3" line="1987"/>
  <Field id="_353" name="mb_cur_max" type="_114" offset="1376" context="_163" access="public" location="f3:1988" file="f3" line="1988"/>
  <Field id="_354" name="lconv_intl_refcount" type="_426" offset="1408" context="_163" access="public" location="f3:1989" file="f3" line="1989"/>
  <Field id="_355" name="lconv_num_refcount" type="_426" offset="1440" context="_163" access="public" location="f3:1990" file="f3" line="1990"/>
  <Field id="_356" name="lconv_mon_refcount" type="_426" offset="1472" context="_163" access="public" location="f3:1991" file="f3" line="1991"/>
  <Field id="_357" name="lconv" type="_443" offset="1504" context="_163" access="public" location="f3:1992" file="f3" line="1992"/>
  <Field id="_358" name="ctype1_refcount" type="_426" offset="1536" context="_163" access="public" location="f3:1993" file="f3" line="1993"/>
  <Field id="_359" name="ctype1" type="_444" offset="1568" context="_163" access="public" location="f3:1994" file="f3" line="1994"/>
  <Field id="_360" name="pctype" type="_445" offset="1600" context="_163" access="public" location="f3:1995" file="f3" line="1995"/>
  <Field id="_361" name="pclmap" type="_446" offset="1632" context="_163" access="public" location="f3:1996" file="f3" line="1996"/>
  <Field id="_362" name="pcumap" type="_446" offset="1664" context="_163" access="public" location="f3:1997" file="f3" line="1997"/>
  <Field id="_363" name="lc_time_curr" type="_447" offset="1696" context="_163" access="public" location="f3:1998" file="f3" line="1998"/>
  <Struct id="_364" context="_163" access="public" mangled="N22threadlocaleinfostruct3$_0E" demangled="threadlocaleinfostruct::$_0" location="f3:1981" file="f3" line="1981" artificial="1" size="128" align="32" members="_448 _449 _450 _451 _452 _453 _454 _455 " bases=""/>
  <Destructor id="_365" name="threadlocaleinfostruct" artificial="1" throw="" context="_163" access="public" mangled="_ZN22threadlocaleinfostructD1Ev *INTERNAL* " demangled="threadlocaleinfostruct::~threadlocaleinfostruct()" location="f3:1975" file="f3" line="1975" endline="1975" inline="1">
  </Destructor>
  <OperatorMethod id="_366" name="=" returns="_456" artificial="1" throw="" context="_163" access="public" mangled="_ZN22threadlocaleinfostructaSERKS_" demangled="threadlocaleinfostruct::operator=(threadlocaleinfostruct const&)" location="f3:1975" file="f3" line="1975" endline="1975" inline="1">
    <Argument type="_457" location="f3:1975" file="f3" line="1975"/>
  </OperatorMethod>
  <Constructor id="_367" name="threadlocaleinfostruct" artificial="1" throw="" context="_163" access="public" mangled="_ZN22threadlocaleinfostructC1ERKS_ *INTERNAL* " demangled="threadlocaleinfostruct::threadlocaleinfostruct(threadlocaleinfostruct const&)" location="f3:1975" file="f3" line="1975" endline="1975" inline="1">
    <Argument type="_457" location="f3:1975" file="f3" line="1975"/>
  </Constructor>
  <Constructor id="_368" name="threadlocaleinfostruct" artificial="1" throw="" context="_163" access="public" mangled="_ZN22threadlocaleinfostructC1Ev *INTERNAL* " demangled="threadlocaleinfostruct::threadlocaleinfostruct()" location="f3:1975" file="f3" line="1975" inline="1"/>
  <Field id="_369" name="Deref" type="_29" offset="0" context="_168" access="public" location="f4:115" file="f4" line="115"/>
  <Field id="_370" name="Valid" type="_270" offset="32" context="_168" access="public" location="f4:116" file="f4" line="116"/>
  <Field id="_371" name="Null" type="_270" offset="64" context="_168" access="public" location="f4:117" file="f4" line="117"/>
  <Field id="_372" name="Tainted" type="_270" offset="96" context="_168" access="public" location="f4:118" file="f4" line="118"/>
  <Field id="_373" name="Access" type="_272" offset="128" context="_168" access="public" location="f4:119" file="f4" line="119"/>
  <Field id="_374" name="ValidElementsConst" type="_161" offset="160" context="_168" access="public" location="f4:120" file="f4" line="120"/>
  <Field id="_375" name="ValidBytesConst" type="_161" offset="192" context="_168" access="public" location="f4:121" file="f4" line="121"/>
  <Field id="_376" name="ValidElements" type="_264" offset="224" context="_168" access="public" location="f4:122" file="f4" line="122"/>
  <Field id="_377" name="ValidBytes" type="_264" offset="256" context="_168" access="public" location="f4:123" file="f4" line="123"/>
  <Field id="_378" name="ValidElementsLength" type="_264" offset="288" context="_168" access="public" location="f4:124" file="f4" line="124"/>
  <Field id="_379" name="ValidBytesLength" type="_264" offset="320" context="_168" access="public" location="f4:125" file="f4" line="125"/>
  <Field id="_380" name="WritableElementsConst" type="_161" offset="352" context="_168" access="public" location="f4:126" file="f4" line="126"/>
  <Field id="_381" name="WritableBytesConst" type="_161" offset="384" context="_168" access="public" location="f4:127" file="f4" line="127"/>
  <Field id="_382" name="WritableElements" type="_264" offset="416" context="_168" access="public" location="f4:128" file="f4" line="128"/>
  <Field id="_383" name="WritableBytes" type="_264" offset="448" context="_168" access="public" location="f4:129" file="f4" line="129"/>
  <Field id="_384" name="WritableElementsLength" type="_264" offset="480" context="_168" access="public" location="f4:130" file="f4" line="130"/>
  <Field id="_385" name="WritableBytesLength" type="_264" offset="512" context="_168" access="public" location="f4:131" file="f4" line="131"/>
  <Field id="_386" name="ElementSizeConst" type="_161" offset="544" context="_168" access="public" location="f4:132" file="f4" line="132"/>
  <Field id="_387" name="ElementSize" type="_264" offset="576" context="_168" access="public" location="f4:133" file="f4" line="133"/>
  <Field id="_388" name="NullTerminated" type="_270" offset="608" context="_168" access="public" location="f4:134" file="f4" line="134"/>
  <Field id="_389" name="MustCheck" type="_270" offset="640" context="_168" access="public" location="f4:135" file="f4" line="135"/>
  <Field id="_390" name="Condition" type="_264" offset="672" context="_168" access="public" location="f4:136" file="f4" line="136"/>
  <Destructor id="_391" name="PostAttribute" artificial="1" throw="" context="_168" access="public" mangled="_ZN13vc_attributes13PostAttributeD1Ev *INTERNAL* " demangled="vc_attributes::PostAttribute::~PostAttribute()" location="f4:110" file="f4" line="110" endline="110" inline="1">
  </Destructor>
  <OperatorMethod id="_392" name="=" returns="_458" artificial="1" throw="" context="_168" access="public" mangled="_ZN13vc_attributes13PostAttributeaSERKS0_" demangled="vc_attributes::PostAttribute::operator=(vc_attributes::PostAttribute const&)" location="f4:110" file="f4" line="110" endline="110" inline="1">
    <Argument type="_459" location="f4:110" file="f4" line="110"/>
  </OperatorMethod>
  <Constructor id="_393" name="PostAttribute" artificial="1" throw="" context="_168" access="public" mangled="_ZN13vc_attributes13PostAttributeC1ERKS0_ *INTERNAL* " demangled="vc_attributes::PostAttribute::PostAttribute(vc_attributes::PostAttribute const&)" location="f4:110" file="f4" line="110" endline="110" inline="1">
    <Argument type="_459" location="f4:110" file="f4" line="110"/>
  </Constructor>
  <Constructor id="_394" name="PostAttribute" explicit="1" context="_168" access="public" mangled="_ZN13vc_attributes13PostAttributeC1Ev *INTERNAL* " demangled="vc_attributes::PostAttribute::PostAttribute()" location="f4:112" file="f4" line="112" extern="1"/>
  <Field id="_395" name="Deref" type="_29" offset="0" context="_175" access="public" location="f4:192" file="f4" line="192"/>
  <Field id="_396" name="MinVal" type="_261" offset="32" context="_175" access="public" location="f4:193" file="f4" line="193"/>
  <Field id="_397" name="MaxVal" type="_261" offset="64" context="_175" access="public" location="f4:194" file="f4" line="194"/>
  <Destructor id="_398" name="PreRangeAttribute" artificial="1" throw="" context="_175" access="public" mangled="_ZN13vc_attributes17PreRangeAttributeD1Ev *INTERNAL* " demangled="vc_attributes::PreRangeAttribute::~PreRangeAttribute()" location="f4:188" file="f4" line="188" endline="188" inline="1">
  </Destructor>
  <OperatorMethod id="_399" name="=" returns="_460" artificial="1" throw="" context="_175" access="public" mangled="_ZN13vc_attributes17PreRangeAttributeaSERKS0_" demangled="vc_attributes::PreRangeAttribute::operator=(vc_attributes::PreRangeAttribute const&)" location="f4:188" file="f4" line="188" endline="188" inline="1">
    <Argument type="_461" location="f4:188" file="f4" line="188"/>
  </OperatorMethod>
  <Constructor id="_400" name="PreRangeAttribute" artificial="1" throw="" context="_175" access="public" mangled="_ZN13vc_attributes17PreRangeAttributeC1ERKS0_ *INTERNAL* " demangled="vc_attributes::PreRangeAttribute::PreRangeAttribute(vc_attributes::PreRangeAttribute const&)" location="f4:188" file="f4" line="188" endline="188" inline="1">
    <Argument type="_461" location="f4:188" file="f4" line="188"/>
  </Constructor>
  <Constructor id="_401" name="PreRangeAttribute" explicit="1" context="_175" access="public" mangled="_ZN13vc_attributes17PreRangeAttributeC1Ev *INTERNAL* " demangled="vc_attributes::PreRangeAttribute::PreRangeAttribute()" location="f4:190" file="f4" line="190" extern="1"/>
  <PointerType id="_402" type="_161" size="32" align="32"/>
  <FundamentalType id="_403" name="long unsigned int" size="32" align="32"/>
  <Field id="_404" name="Deref" type="_29" offset="0" context="_240" access="public" location="f4:203" file="f4" line="203"/>
  <Field id="_405" name="MinVal" type="_261" offset="32" context="_240" access="public" location="f4:204" file="f4" line="204"/>
  <Field id="_406" name="MaxVal" type="_261" offset="64" context="_240" access="public" location="f4:205" file="f4" line="205"/>
  <Destructor id="_407" name="PostRangeAttribute" artificial="1" throw="" context="_240" access="public" mangled="_ZN13vc_attributes18PostRangeAttributeD1Ev *INTERNAL* " demangled="vc_attributes::PostRangeAttribute::~PostRangeAttribute()" location="f4:199" file="f4" line="199" endline="199" inline="1">
  </Destructor>
  <OperatorMethod id="_408" name="=" returns="_462" artificial="1" throw="" context="_240" access="public" mangled="_ZN13vc_attributes18PostRangeAttributeaSERKS0_" demangled="vc_attributes::PostRangeAttribute::operator=(vc_attributes::PostRangeAttribute const&)" location="f4:199" file="f4" line="199" endline="199" inline="1">
    <Argument type="_463" location="f4:199" file="f4" line="199"/>
  </OperatorMethod>
  <Constructor id="_409" name="PostRangeAttribute" artificial="1" throw="" context="_240" access="public" mangled="_ZN13vc_attributes18PostRangeAttributeC1ERKS0_ *INTERNAL* " demangled="vc_attributes::PostRangeAttribute::PostRangeAttribute(vc_attributes::PostRangeAttribute const&)" location="f4:199" file="f4" line="199" endline="199" inline="1">
    <Argument type="_463" location="f4:199" file="f4" line="199"/>
  </Constructor>
  <Constructor id="_410" name="PostRangeAttribute" explicit="1" context="_240" access="public" mangled="_ZN13vc_attributes18PostRangeAttributeC1Ev *INTERNAL* " demangled="vc_attributes::PostRangeAttribute::PostRangeAttribute()" location="f4:201" file="f4" line="201" extern="1"/>
  <FundamentalType id="_325" name="char" size="8" align="8"/>
  <Field id="_411" name="key" type="_65" offset="0" context="_257" access="public" location="f6:12" file="f6" line="12"/>
  <Field id="_412" name="data" type="_114" offset="32" context="_257" access="public" location="f6:13" file="f6" line="13"/>
  <Field id="_413" name="next" type="_209" offset="64" context="_257" access="public" location="f6:14" file="f6" line="14"/>
  <Destructor id="_414" name="HTentry" artificial="1" throw="" context="_257" access="public" mangled="_ZN7HTentryD1Ev *INTERNAL* " demangled="HTentry::~HTentry()" location="f6:11" file="f6" line="11" endline="11" inline="1">
  </Destructor>
  <OperatorMethod id="_415" name="=" returns="_464" artificial="1" throw="" context="_257" access="public" mangled="_ZN7HTentryaSERKS_" demangled="HTentry::operator=(HTentry const&)" location="f6:11" file="f6" line="11" endline="11" inline="1">
    <Argument type="_465" location="f6:11" file="f6" line="11"/>
  </OperatorMethod>
  <Constructor id="_416" name="HTentry" artificial="1" throw="" context="_257" access="public" mangled="_ZN7HTentryC1ERKS_ *INTERNAL* " demangled="HTentry::HTentry(HTentry const&)" location="f6:11" file="f6" line="11" endline="11" inline="1">
    <Argument type="_465" location="f6:11" file="f6" line="11"/>
  </Constructor>
  <Constructor id="_417" name="HTentry" artificial="1" throw="" context="_257" access="public" mangled="_ZN7HTentryC1Ev *INTERNAL* " demangled="HTentry::HTentry()" location="f6:11" file="f6" line="11" inline="1"/>
  <ReferenceType id="_420" type="_15" size="32" align="32"/>
  <ReferenceType id="_421" type="_15c" size="32" align="32"/>
  <ReferenceType id="_422" type="_35" size="32" align="32"/>
  <ReferenceType id="_423" type="_35c" size="32" align="32"/>
  <ReferenceType id="_424" type="_40" size="32" align="32"/>
  <ReferenceType id="_425" type="_40c" size="32" align="32"/>
  <PointerType id="_426" type="_114" size="32" align="32"/>
  <ReferenceType id="_427" type="_44" size="32" align="32"/>
  <ReferenceType id="_428" type="_44c" size="32" align="32"/>
  <ReferenceType id="_429" type="_45" size="32" align="32"/>
  <ReferenceType id="_430" type="_45c" size="32" align="32"/>
  <ReferenceType id="_432" type="_63" size="32" align="32"/>
  <ReferenceType id="_433" type="_63c" size="32" align="32"/>
  <ReferenceType id="_434" type="_88" size="32" align="32"/>
  <ReferenceType id="_435" type="_88c" size="32" align="32"/>
  <ReferenceType id="_436" type="_108" size="32" align="32"/>
  <ReferenceType id="_437" type="_108c" size="32" align="32"/>
  <ReferenceType id="_438" type="_137" size="32" align="32"/>
  <ReferenceType id="_439" type="_137c" size="32" align="32"/>
  <ArrayType id="_440" min="0" max="5u" type="_403" size="192" align="32"/>
  <ArrayType id="_441" min="0" max="5u" type="_46" size="288" align="16"/>
  <ArrayType id="_442" min="0" max="5u" type="_364" size="768" align="32"/>
  <PointerType id="_443" type="_208" size="32" align="32"/>
  <PointerType id="_444" type="_11" size="32" align="32"/>
  <PointerType id="_445" type="_11c" size="32" align="32"/>
  <PointerType id="_446" type="_476c" size="32" align="32"/>
  <PointerType id="_447" type="_177" size="32" align="32"/>
  <Field id="_448" name="locale" type="_65" offset="0" context="_364" access="public" location="f3:1982" file="f3" line="1982"/>
  <Field id="_449" name="wlocale" type="_259" offset="32" context="_364" access="public" location="f3:1983" file="f3" line="1983"/>
  <Field id="_450" name="refcount" type="_426" offset="64" context="_364" access="public" location="f3:1984" file="f3" line="1984"/>
  <Field id="_451" name="wrefcount" type="_426" offset="96" context="_364" access="public" location="f3:1985" file="f3" line="1985"/>
  <Destructor id="_452" name="$_0" artificial="1" throw="" context="_364" access="public" mangled="_ZN22threadlocaleinfostruct3$_0D1Ev *INTERNAL* " demangled="threadlocaleinfostruct::$_0::~$_0()" location="f3:1981" file="f3" line="1981" endline="1981" inline="1">
  </Destructor>
  <OperatorMethod id="_453" name="=" returns="_478" artificial="1" throw="" context="_364" access="public" mangled="_ZN22threadlocaleinfostruct3$_0aSERKS0_" demangled="threadlocaleinfostruct::$_0::operator=(threadlocaleinfostruct::$_0 const&)" location="f3:1981" file="f3" line="1981" endline="1981" inline="1">
    <Argument type="_479" location="f3:1981" file="f3" line="1981"/>
  </OperatorMethod>
  <Constructor id="_454" artificial="1" throw="" context="_364" access="public" mangled="_ZN22threadlocaleinfostruct3$_0C1ERKS0_ *INTERNAL* " demangled="threadlocaleinfostruct::$_0::$_0(threadlocaleinfostruct::$_0 const&)" location="f3:1981" file="f3" line="1981" endline="1981" inline="1">
    <Argument type="_479" location="f3:1981" file="f3" line="1981"/>
  </Constructor>
  <Constructor id="_455" artificial="1" throw="" context="_364" access="public" mangled="_ZN22threadlocaleinfostruct3$_0C1Ev *INTERNAL* " demangled="threadlocaleinfostruct::$_0::$_0()" location="f3:1981" file="f3" line="1981" inline="1"/>
  <ReferenceType id="_456" type="_163" size="32" align="32"/>
  <ReferenceType id="_457" type="_163c" size="32" align="32"/>
  <ReferenceType id="_458" type="_168" size="32" align="32"/>
  <ReferenceType id="_459" type="_168c" size="32" align="32"/>
  <ReferenceType id="_460" type="_175" size="32" align="32"/>
  <ReferenceType id="_461" type="_175c" size="32" align="32"/>
  <ReferenceType id="_462" type="_240" size="32" align="32"/>
  <ReferenceType id="_463" type="_240c" size="32" align="32"/>
  <ReferenceType id="_464" type="_257" size="32" align="32"/>
  <ReferenceType id="_465" type="_257c" size="32" align="32"/>
  <ReferenceType id="_478" type="_364" size="32" align="32"/>
  <ReferenceType id="_479" type="_364c" size="32" align="32"/>
  <FundamentalType id="_476" name="unsigned char" size="8" align="8"/>
  <CvQualifiedType id="_325c" type="_325" const="1"/>
  <CvQualifiedType id="_260c" type="_260" const="1"/>
  <CvQualifiedType id="_35c" type="_35" const="1"/>
  <CvQualifiedType id="_168c" type="_168" const="1"/>
  <CvQualifiedType id="_108c" type="_108" const="1"/>
  <CvQualifiedType id="_88c" type="_88" const="1"/>
  <CvQualifiedType id="_40c" type="_40" const="1"/>
  <CvQualifiedType id="_137c" type="_137" const="1"/>
  <CvQualifiedType id="_15c" type="_15" const="1"/>
  <CvQualifiedType id="_175c" type="_175" const="1"/>
  <CvQualifiedType id="_240c" type="_240" const="1"/>
  <CvQualifiedType id="_63c" type="_63" const="1"/>
  <CvQualifiedType id="_45c" type="_45" const="1"/>
  <CvQualifiedType id="_364c" type="_364" const="1"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <CvQualifiedType id="_476c" type="_476" const="1"/>
  <CvQualifiedType id="_163c" type="_163" const="1"/>
  <CvQualifiedType id="_44c" type="_44" const="1"/>
  <CvQualifiedType id="_271c" type="_271" const="1"/>
  <CvQualifiedType id="_257c" type="_257" const="1"/>
  <File id="f0" name="C:/Program Files (x86)/Microsoft Visual Studio 10.0/VC/include/string.h"/>
  <File id="f1" name="C:/Program Files (x86)/Microsoft Visual Studio 10.0/VC/include/malloc.h"/>
  <File id="f2" name="D:\1.8\source5_1_007\hash.c"/>
  <File id="f3" name="D:/gccxml_build/GCC_XML/Support/Vc10/Include/crtdefs.h"/>
  <File id="f4" name="D:/gccxml_build/GCC_XML/Support/Vc10/Include/codeanalysis\sourceannotations.h"/>
  <File id="f5" name="C:/Program Files (x86)/Microsoft Visual Studio 10.0/VC/include/vadefs.h"/>
  <File id="f6" name="D:\1.8\source5_1_007\/hash.h"/>
</GCC_XML>


